### Задание 1: Имена
Исходные данные
names.txt
В текстовом файле содержится набор имён.
#### Задача
Нужно выполнить следующие действия и вывести результат вычислений:
1.	Отсортировать все имена в лексикографическом порядке.
2.	Посчитать для каждого имени алфавитную сумму – сумму порядковых номеров букв (MAY: 13 + 1 + 25 = 39).
3.	Умножить алфавитную сумму каждого имени на порядковый номер имени в отсортированном списке (индексация начинается с 1). Например, если MAY находится на 63 месте в списке, то результат для него будет 63 * 39 = 2457.
4.	Сложить произведения из п. 3 для всех имен из файла и получить число.
5.	Вывести полученную сумму.

In [52]:
import pandas as pd
from string import ascii_uppercase

In [53]:
names_list = []
f = open('files/names.txt')
for line in f:
    names_list = line.split(',')

In [54]:
names_list_correct = []

for el in names_list:
    new_el = el[1 : -1]
    names_list_correct.append(new_el)

In [55]:
names_list_alph = sorted(names_list_correct)
index_num = [i + 1 for i in range(len(names_list_alph))]

In [56]:
names_df = pd.DataFrame({'index_num': index_num, 'names': names_list_alph})
print(names_df)

      index_num    names
0             1    AARON
1             2    ABBEY
2             3    ABBIE
3             4     ABBY
4             5    ABDUL
...         ...      ...
5160       5161     ZORA
5161       5162  ZORAIDA
5162       5163     ZULA
5163       5164   ZULEMA
5164       5165    ZULMA

[5165 rows x 2 columns]

In [57]:
alph_list = list(ascii_uppercase)
list_sum = []

for el in names_list_alph:
    sum_index = 0
    for elem in el:
        index_letter = alph_list.index(elem) + 1
        sum_index += index_letter
    list_sum.append(sum_index)

In [58]:
names_df['index_sum'] = list_sum

In [59]:
names_df

      index_num    names  index_sum
0             1    AARON         49
1             2    ABBEY         35
2             3    ABBIE         19
3             4     ABBY         30
4             5    ABDUL         40
...         ...      ...        ...
5160       5161     ZORA         60
5161       5162  ZORAIDA         74
5162       5163     ZULA         60
5163       5164   ZULEMA         78
5164       5165    ZULMA         73

[5165 rows x 3 columns]

In [60]:
names_df['index_X_sum'] = names_df['index_num'] * names_df['index_sum']
names_df

      index_num    names  index_sum  index_X_sum
0             1    AARON         49           49
1             2    ABBEY         35           70
2             3    ABBIE         19           57
3             4     ABBY         30          120
4             5    ABDUL         40          200
...         ...      ...        ...          ...
5160       5161     ZORA         60       309660
5161       5162  ZORAIDA         74       381988
5162       5163     ZULA         60       309780
5163       5164   ZULEMA         78       402792
5164       5165    ZULMA         73       377045

[5165 rows x 4 columns]

In [61]:
total_sum = names_df['index_X_sum'].sum()
total_sum

871853874